//-----------------------------------------------------------------------------------------------------------
// Copyright (C) 2015-2016 SiegeOnline
// 版权所有
//
// 文件名：MessageCode.cs
//
// 文件功能描述：
//
// 客户端喊话消息的权限级别
//
// 创建标识：taixihuase 20150714
//
// 修改标识：
// 修改描述：
// 
//
// 修改标识：
// 修改描述：
//
//----------------------------------------------------------------------------------------------------------

namespace SiegeOnlineServer.Protocol
{
    /// <summary>
    /// 类型：枚举
    /// 名称：MessageCode
    /// 作者：taixihuase
    /// 作用：消息代码枚举值
    /// 编写日期：2015/7/14
    /// </summary>
    public enum MessageCode : byte
    {
    }
}
